Revit 2024 API
AssetProperty.RemoveConnectedAsset Method
 Removes the connected asset attached to this asset property if any.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public void RemoveConnectedAsset()
Visual Basic
Public Sub RemoveConnectedAsset
Visual C++
public:
void RemoveConnectedAsset()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The asset property is not editable. -or- Cannot check validity for a property not being edited in AppearanceAssetEditScope.
See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace